#cs
كود سورس لبرنامج صغير
يوقوم بتحويل من النصوص إلى النظام السداسي عشر
و إظافة دالة التحويل من السداسي عشر إلى نصوص
قد تحتاج هذا البرنامج في حالة كتابة لنصوص في برنامجك بالغة العربية
و أرت تشفير الكود سوس الخاص بالأتويت او لغة أخرى
حيث انه بعد التشفير تصبح اللغة غير مقرئة
هذا البرنامج يسهل عليك نسخ فقط النص العربي و غعادة لصقه فقط
حيث انه عند النسخ يحول من النص إلى النظام السادس عشر
و وضغها في الحافظة
و ند اللصق تصق معها دالة التحويل أي عند تنفيذ البرنامج يتم الترجمة من السادس عشر إلى النص
وهذا لتفادي مشل اللغة العربية بعد تشفير الكود سورس
#ce
#include <String.au3>
ClipPut("") ;; تهيئة الحافظة لنص فارغ
Global $old = "" ;; هذا لنضع فيه النصوص
While 1
$zqe = ClipGet() ;; لجلب النصوص من الحافظة
If $zqe = "" Then ContinueLoop  ;; يبقى في الدوران مدامت القيمة فارغة
If StringInStr($zqe,"_HexToString") Then ContinueLoop ;;;; التحقق من انه يحمل النص المشفر و يكمل الدوران
If $zqe = "Exit" Then exit  ;;; الخروج من البرنامج غذا تم نسخ كلمة exit
If $zqe = $old Then ContinueLoop ;; في حالة تطابق القيمة القديمة مع الجديد يبقى في الدوران
$ze = '_HexToString("'&_StringToHex($zqe)&'")' ;; التحويل و إظافة دالة الترجمة
ClipPut($ze) ;; وضع الناتج في الحافظة
$old = $ze ;; تحديث القيمية القديمة
WEnd
